## Answering Business Questions with SQL
A dataquest guided project

Using the Chinook Database, answer business questions to practice querying the DB with more complex queries. 

Table Schema here: 
(https://s3.amazonaws.com/dq-content/190/chinook-schema.svg)

In [1]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

We can get a look at the database tables here. We can also use this query to make sure the DB is initialized properly

In [4]:
%%sql
SELECT name, type
  FROM sqlite_master
 WHERE type IN ('table', 'view')

 * sqlite:///chinook.db
Done.

[('album', 'table'),
 ('artist', 'table'),
 ('customer', 'table'),
 ('employee', 'table'),
 ('genre', 'table'),
 ('invoice', 'table'),
 ('invoice_line', 'table'),
 ('media_type', 'table'),
 ('playlist', 'table'),
 ('playlist_track', 'table'),
 ('track', 'table')]


## Which Genres Sell the MOST in the USA?

The Chinook record store has just signed a deal with a new record label, and you've been tasked with selecting the first three albums that will be added to the store, from a list of four. All four albums are by artists that don't have any tracks in the store right now - we have the artist names, and the genre of music they produce:


<table>
    <td>Artist Name</td>
    <td>Genre</td>
    <tr>
    <td>Regal</td>
    <td>Hip Hop </td>
    </tr>
    <tr>
    <td>Red Tone</td>
    <td>Punk</td>
    </tr>
    <tr>
    <td>Meteor and the Girls</td>
    <td>Pop </td>
    </tr>
    <tr>
    <td>Slim Jim Bites</td>
    <td>Blues</td>
    </tr>
</table>

The record label specializes in artists from the USA, and they have given Chinook some money to advertise the new albums in the USA, so we're interested in finding out which genres sell the best in the USA.

You'll need to write a query to find out which genres sell the most tracks in the USA, write up a summary of your findings, and make a recommendation for the three artists whose albums we should purchase for the store.


_Planning my query: 
Return Grouped by Genre: number of tracks sold in the USA_

In [33]:
%%sql
WITH invoices_genres AS (
    SELECT 
        invoice.total AS invoicetotal,
        genre.name AS genre
    FROM invoice
    LEFT JOIN invoice_line ON invoice_line.invoice_id = invoice.invoice_id
    LEFT JOIN track ON track.track_id = invoice_line.track_id
    LEFT JOIN genre ON genre.genre_id = track.genre_id
    WHERE invoice.billing_country = "USA"
)
SELECT 
    genre,
    SUM(invoicetotal) AS totalSales
FROM invoices_genres
WHERE genre IN ("Hip Hop/Rap", "Alternative & Punk", "Pop", "Blues")
GROUP BY genre
ORDER BY totalSales DESC;

 * sqlite:///chinook.db
Done.

[('Alternative & Punk', 1234.5300000000018),
 ('Blues', 453.4199999999998),
 ('Hip Hop/Rap', 366.3),
 ('Pop', 201.95999999999992)]

In [31]:
%%sql
SELECT * FROM genre
GROUP BY name;

 * sqlite:///chinook.db
Done.

[(23, 'Alternative'),
 (4, 'Alternative & Punk'),
 (6, 'Blues'),
 (11, 'Bossa Nova'),
 (24, 'Classical'),
 (22, 'Comedy'),
 (21, 'Drama'),
 (12, 'Easy Listening'),
 (15, 'Electronica/Dance'),
 (13, 'Heavy Metal'),
 (17, 'Hip Hop/Rap'),
 (2, 'Jazz'),
 (7, 'Latin'),
 (3, 'Metal'),
 (25, 'Opera'),
 (9, 'Pop'),
 (14, 'R&B/Soul'),
 (8, 'Reggae'),
 (1, 'Rock'),
 (5, 'Rock And Roll'),
 (20, 'Sci Fi & Fantasy'),
 (18, 'Science Fiction'),
 (10, 'Soundtrack'),
 (19, 'TV Shows'),
 (16, 'World')]